{"pageProps":{"postData":{"birthtime":"2023-05-02T01:32:57.638Z","mtime":"2023-05-02T01:32:57.638Z","slug":"2023/14","wordCount":738,"contentHtml":"<p>我们示例中的博客文章将作为本地降价文件存储在我们应用程序的目录中（不是从外部数据源获取），因此我们需要从文件系统中读取数据。</p>\n<p>在本节中，我们将完成创建一个从文件系统读取降价数据的博客的步骤。</p>\n<h2>创建 .md 文件</h2>\n<p>首先，在项目根目录创建一个 <code>posts</code> 文件夹，在这个文件里创建两个 <code>.md</code> 文件。两个名为 <code>first.md</code> 、 <code>about.md</code> 的文件。</p>\n<p>现在，将以下代码复制到 <code>posts/first.md</code> 文件里：</p>\n<div class=\"remark-highlight\"><pre class=\"language-md\"><code class=\"language-md\"><span class=\"token front-matter-block\"><span class=\"token punctuation\">---</span>\n<span class=\"token front-matter yaml language-yaml\"><span class=\"token key atrule\">title</span><span class=\"token punctuation\">:</span> 'FanMa's High<span class=\"token punctuation\">-</span>Performance Blog Built with Next.js 13'\n<span class=\"token key atrule\">date</span><span class=\"token punctuation\">:</span> <span class=\"token string\">'2023-01-01'</span></span>\n<span class=\"token punctuation\">---</span></span>\n\nFanMa is a developer who doesn't know JavaScript language, and recently he developed a blog platform using Next.js 13. This platform not only has a beautiful design, but also is very user-friendly.\n\nNext.js 13 is a promising framework that takes React applications to new heights. It provides some useful features, eliminates many common troubles, and produces applications with higher performance and better user experience.\n\nFanMa's blog platform is a good example, and many features of Next.js 13 are applied in this platform.\n\nFirstly, the performance of this platform is excellent. Next.js 13 provides a very fast development environment, allowing developers to create high-performance applications in a short time.\n\nSecondly, this platform is extremely user-friendly. FanMa spent a lot of time designing the interface when developing this platform to ensure that users can use the platform easily and naturally.\n\nFinally, this platform is scalable. FanMa has implemented some very intelligent features to improve the scalability of the platform. For example, he uses some artificial intelligence algorithms to predict with neural networks, so as to automatically generate the best matching tags and improve the searchability of articles.\n\nOverall, FanMa's blog platform is a great example that showcases some of the real advantages of Next.js 13. This platform has excellent performance, is easy to use, and has scalability and many other useful features. We hope to see more developers using Next.js 13 in their applications.\n</code></pre></div>\n<p>现在，将以下代码复制到 <code>posts/about.md</code> 文件里：</p>\n<div class=\"remark-highlight\"><pre class=\"language-md\"><code class=\"language-md\"><span class=\"token front-matter-block\"><span class=\"token punctuation\">---</span>\n<span class=\"token front-matter yaml language-yaml\"><span class=\"token key atrule\">title</span><span class=\"token punctuation\">:</span> <span class=\"token string\">'About FanMa'</span>\n<span class=\"token key atrule\">date</span><span class=\"token punctuation\">:</span> <span class=\"token string\">'2023-01-01'</span></span>\n<span class=\"token punctuation\">---</span></span>\n\nFanMa is a highly respected developer with a profound understanding and solid experience in programming technology and innovation. His work and achievements have been widely recognized and admired throughout the development community.\n\nFanMa excels at using modern frontend technologies to create excellent web applications, and his high-level skills have gained widespread recognition and praise in this field. He is also committed to sharing his experiences and knowledge with others and participating actively in collaborative work in open-source communities.\n\nFanMa's career began in the early 1990s when he developed a text editor called \"FanMa Editor\", which provided convenient editing tools for many people. Later, he turned to web development and leveraged his frontend skills to develop a series of outstanding applications and tools.\n\nIn addition to his own work and innovation, FanMa actively participates in community work. He has made many contributions to the community in various open-source projects. He is also a dedicated member of several computer technology forums and provides technical help and support to other developers in these forums.\n\nOverall, FanMa is a developer with strong technical abilities and broad creative thinking. His achievements and technical contributions have been widely recognized and praised throughout the web development community, demonstrating his leadership position in this field. We look forward to seeing FanMa continue to demonstrate his talent in the future and bring more innovation and great works to web development.\n</code></pre></div>\n<p>您可能已经注意到，每个 <code>.md</code> 文件的顶部都有一个元数据部分，其中包含 title 和 date 。这称为 YAML Front Matter，可以使用名为 <code>gray-matter</code> 的库对其进行解析。</p>\n","title":"使用 Next.js 创建一个简单的博客架构","date":"2023-03-26","category":"博客日记","tag":["Next.js","全局","布局"]}},"__N_SSG":true}